app/controllers/trades_controller.rb

SELECT "trades".* FROM "trades"
---
  def index
  	@trades = Trade.includes(:brokerage, :counterparty, :instrument, :location, :mtm, :note, :tag, :trader)